#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_dataeng: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00NDljMTk5OC1lYzgwLTQ4NmQtYjkwYi02MTRlZDFjMzE3Zjg7b2JqZWN0SWQ9Y2IxMTMzNjgtYWI0NC00YjU4LWI2NzgtYjA0Y2I5YWJhNDE3O3N1YnNjcmlwdGlvbklkPWJlMjU4MjBhLWRmODYtNDc5NC05ZTk1LTZhNDVjZDVjMDk0MTt0ZW5hbnRJZD01NzJjZjFlYy0zZjkwLTQ5YTItODk2Zi1hYjJmYTM2Y2EwZDM=][0m
[0m[1mazurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001][0m
[0m[1mazurerm_kusto_cluster.kusto_cluster: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Reading...[0m[0m
[0m[1mazurerm_kusto_database.kusto_database["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb][0m
[0m[1mdata.azurerm_location.current: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/locations/germanywestcentral][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Reading...[0m[0m
[0m[1mazurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoint_kusto_cluster: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001/managedVirtualNetworks/default/managedPrivateEndpoints/AzureDataExplorer][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_viewer["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Viewer-sc4-dev-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_ingestor["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Ingestor-sc4-dev-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_admin["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Admin-sc4-dev-df001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001][0m
[0m[1mazurerm_kusto_script.kusto_script["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/scripts/init-db-operationaldb][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/0f0fdc3c-5961-441f-f811-019b6a6bc73a][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/c9f180cf-8a11-d590-165d-eb053e78cc79][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001][0m
[0m[1mazurerm_storage_container.storage_container["raw"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/raw][0m
[0m[1mazurerm_storage_container.storage_container["logs"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/logs][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/b27b6bd8-2689-3b3c-3ee5-eb0b22dffa41][0m
[0m[1mazurerm_storage_container.storage_container["upload-otv"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-otv][0m
[0m[1mazurerm_role_assignment.current_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/ae99ddc5-4a50-2614-6069-a367972993f8][0m
[0m[1mazurerm_storage_container.storage_container["upload-iptv"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-iptv][0m
[0m[1mazurerm_storage_container.storage_container["curated"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/curated][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # azurerm_storage_container.storage_container["upload-ott"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "upload-ott"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1m  # azurerm_storage_container.storage_container["upload-otv"][0m will be [1m[31mdestroyed[0m
  # (because key ["upload-otv"] is not in for_each map)
[0m  [31m-[0m[0m resource "azurerm_storage_container" "storage_container" {
      [31m-[0m[0m container_access_type             = "private" [90m-> null[0m[0m
      [31m-[0m[0m default_encryption_scope          = "$account-encryption-key" [90m-> null[0m[0m
      [31m-[0m[0m encryption_scope_override_enabled = true [90m-> null[0m[0m
      [31m-[0m[0m has_immutability_policy           = false [90m-> null[0m[0m
      [31m-[0m[0m has_legal_hold                    = false [90m-> null[0m[0m
      [31m-[0m[0m id                                = "https://sc4devstg001.blob.core.windows.net/upload-otv" [90m-> null[0m[0m
      [31m-[0m[0m metadata                          = {} [90m-> null[0m[0m
      [31m-[0m[0m name                              = "upload-otv" [90m-> null[0m[0m
      [31m-[0m[0m resource_manager_id               = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/blobServices/default/containers/upload-otv" [90m-> null[0m[0m
      [31m-[0m[0m storage_account_name              = "sc4devstg001" [90m-> null[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>